{
    "architectures": ["LlamaForCausalLM"],
    "bos_token_id": 1,
    "eos_token_id": 2,
    "initializer_range": 0.02,
    "aux_loss_alpha": 0.01,
    "hidden_act": "silu",
    "tie_word_embeddings": true,
    "dropout": 0.0,
    "flash_attn": true,
    "hidden_size": 768,
    "intermediate_size": 2048,
    "model_type": "llama",
    "multiple_of": 512,
    "num_attention_heads": 16,
    "num_key_value_heads": 4,
    "num_hidden_layers": 16,
    "max_position_embeddings": 512,
    "n_routed_experts": 4,
    "n_shared_experts": true,
    "rms_norm_eps": 1e-5,
    "norm_topk_prob": true,
    "num_experts_per_tok": 2,
    "scoring_func": "softmax",
    "seq_aux": true,
    "torch_dtype": "float32",
    "transformers_version": "4.44.0",
    "use_moe": false,
    "vocab_size": 6400
}
